/*
 * @Author: zhouyou@werun 
 * @Descriptions:发布免责声明页面 
 * @Date: 2018-07-06 10:16:53 
 * @Last Modified by: zhouyou@werun
 * @Last Modified time: 2018-07-06 10:48:39
 */


<template>
    <div id="release-disclaimer-page">
        <h3>免责声明</h3>
        <textarea class="disclaimer-content" v-model="conetnt"></textarea>
        <button class="common-button"> 确认发布
        </button>
    </div>
</template>


<script>
const ReleaseDisclaimerPage = {
    data: function() {
        return {
            conetnt:
                "\t寻房短租网由易云游网络技术（北京）有限公司运营的，属于提供技术支持的平台公司，涉及具体产品服务的，将由有资质的服务商或代理商提供。如果您在本网站、蚂蚁短租关联公司网站或其他蚂蚁短租提供的移动应用或软件上（以下简称“蚂蚁短租网”），访问、预定或使用蚂蚁短租的产品或服务（以上统称为“服务”），便视为用户接受了以下免责说明，请您仔细阅读以下内容，尤其是以下加粗及下划线字体。如果您不同意以下任何内容，请立刻停止访问/使用本网站或其他任何移动应用或软件所提供的相关服务。\n\n" +
                "\t您完全同意及认可，蚂蚁短租网是提供平台技术服务的合法公司，将具有相应资质或合法权益的酒店、旅馆、公寓、民宿、保洁信息、特色体验信息、旅行咨询或服务信息汇集于蚂蚁短租网供用户查阅，同时帮助用户通过蚂蚁短租网与上述服务提供商联系并预订相关服务项目。除明确交易一方主体为蚂蚁短租外，交易的实质主体为上述服务提供商，蚂蚁短租网并非交易的一方，对交易过程中产生的纠纷，并不承担相关责任，但蚂蚁短租网会尽力协助用户与相关服务提供商行协商。\n\n" +
                "\t您完全同意及认可，蚂蚁短租网是提供平台技术服务的合法公司，将具有相应资质或合法权益的酒店、旅馆、公寓、民宿、保洁信息、特色体验信息、旅行咨询或服务信息汇集于蚂蚁短租网供用户查阅，同时帮助用户通过蚂蚁短租网与上述服务提供商联系并预订相关服务项目。除明确交易一方主体为蚂蚁短租外，交易的实质主体为上述服务提供商，蚂蚁短租网并非交易的一方，对交易过程中产生的纠纷，并不承担相关责任，但蚂蚁短租网会尽力协助用户与相关服务提供商行协商。\n\n" +
                "\t您完全理解并同意，鉴于蚂蚁短租以非人工检索方式、根据您键入的关键字或点击特定的产品或服务关键字自动生成的网页链接或相关的产品信息描述，例如价格、库存等，上述非人工检索方式，因缓存时间间隔或检索方式非完全智能等原因，有可能造成信息更新不及时或产品服务信息聚合、抽取不精准等瑕疵，您完全理解并豁免上述产品或服务瑕疵给您造成的不便，蚂蚁短租不承担任何责任。\n\n" +
                "\t为方便您的使用，蚂蚁短租可能会对产品的可信赖程度而进行的评级、推荐或风险提示仅供您参考，蚂蚁短租不担保该等评级、推荐或风险提示的准确性和完整性，对推荐的网站的内容及服务亦不承担任何责任。\n\n" +
                "\t您完全理解并同意，您通过蚂蚁短租购买的产品或服务或此后新的产品和服务，应按照相关网页中展示的说明、规定或政策等履行相关义务，享有相关权利，该等说明、规定或政策等与本说明共同构成您和蚂蚁短租的整体协议，您必须严格遵守。\n\n" +
                "\t您了解并理解，任何经由蚂蚁短租网提供服务而发布的图形、图片或个人言论等，均表示了内容提供者、服务使用者个人的观点、观念和思想，并不代表蚂蚁短租的观点或主张，对于在享受网络服务的过程中可能会接触到令人不快、不适当等内容的，由您个人自行加以判断并承担所有风险，蚂蚁短租不承担任何责任。\n\n" +
                "蚂蚁短租为所有出行服务提供方、第三方代理商（包括但不限于住宿、旅游产品、景点门票等）提供一个在线平台，供其宣传自己可供预订的产品及服务。例如，蚂蚁短租平台上的临时住宿产品及服务信息（包括但不限于住宿方名称、联系人及联络信息、住宿场所的描述和说明、相关图片、视频等）均由住宿方自行提供并上传，由住宿提供方对其提供并上传的所有信息承担相应法律责任。各住宿提供方均能通过后台自行更新其房价、可预订客房数量以及显示在蚂蚁短租平台上的其它信息。\n\n" +
                "\t您完全理解并同意，通过蚂蚁短租购买的产品或服务或此后新的产品和服务时，您在预订产品或服务后应当及时付款；您在预订产品或服务后未全额支付前，您尚未完成购买上述产品或服务。因上述产品或服务的价格、舱位、数量或库存等实时更新或变化而造成您的额外费用、损失或无库存等，由您自行承担，蚂蚁短租不承担任何责任。您完全理解并同意，您在支付过程中，因网络中断、银行反馈信息错误等非蚂蚁短租的原因造成的付款失败，由您自行承担，蚂蚁短租不承担任何责任。\n\n" +
                "\t请您及时保存或备份您的文字、图片等其他信息，您完全理解并同意，由于蚂蚁短租储存设备有限、设备故障、设备更新或设备受到攻击等设备原因或人为原因，您使用网路服务储存的信息或数据等全部或部分发生删除、毁损、灭失或无法恢复的风险，均由您自行承担，蚂蚁短租不承担任何责任。\n\n" +
                "\t若有任何服务条款与法律相抵触，那这些条款将按尽可能接近的方法重新解析，而其它条款则保持对用户产生法律效力和影响。因解释本免责声明以及用户通过蚂蚁短租网预订任何产品而导致的争议，将同意接受网站注册地北京市顺义区人民法院的管辖。\n\n"
        };
    }
};

export default ReleaseDisclaimerPage;
</script>


<style lang="scss" scoped>
#release-disclaimer-page {
    padding: 30px;

    h2 {
        font-size: 30px;
    }

    .disclaimer-content {
        width: 100%;
        min-height: 600px;
        border: 1px solid #bbb;
    }

    .common-button {
        margin-top: 35px;
        width: 150px;
        height: 40px;
    }
}
</style>

